CI4propre/Projet_tech/app/Models/ClientModel.php

    public function getClients()
    {
        return $this->findAll();
---
SELECT *
FROM `client`