CI4propre/Projet_tech/app/Models/FraisModel.php

    public function getFrais()
    {
        return $this->findAll();
---
SELECT *
FROM `frais`