CI4propre/Projet_tech/app/Models/OperateurModel.php

SELECT *
FROM `operateur`
---
    public function getOperateur(){
        return $this->findAll();