CI4propre/Projet_tech/app/Models/TransactionModel.php

    public function getTransactions()
    {
        return $this->select("
                transaction.*,
                client.nom,
                client.numero,
                operateur.nom AS operateur,
                frais.frais
            ")
            ->join('client', 'client.id_client = transaction.id_client')
            ->join('operateur', 'operateur.id_operateur = transaction.id_operateur')
            ->join('frais', 'frais.id_frais = transaction.id_frais')
            ->findAll();
---
SELECT `transaction`.*, `client`.`nom`, `client`.`numero`, `operateur`.`nom` as `operateur`, `frais`.`frais`
FROM `transaction`
JOIN `client` ON `client`.`id_client` = `transaction`.`id_client`
JOIN `operateur` ON `operateur`.`id_operateur` = `transaction`.`id_operateur`
JOIN `frais` ON `frais`.`id_frais` = `transaction`.`id_frais`

    public function getSituationOperateur($idOperateur)
    {
        return $this->select("
                transaction.*,
                client.nom,
                client.numero,
                operateur.nom AS operateur,
                frais.frais
            ")
            ->join('client', 'client.id_client = transaction.id_client')
            ->join('operateur', 'operateur.id_operateur = transaction.id_operateur')
            ->join('frais', 'frais.id_frais = transaction.id_frais')
            ->where('transaction.id_operateur', $idOperateur)
            ->findAll();
---
SELECT `transaction`.*, `client`.`nom`, `client`.`numero`, `operateur`.`nom` AS `operateur`, `frais`.`frais`
FROM `transaction`
JOIN `client` ON `client`.`id_client` = `transaction`.`id_client`
JOIN `operateur` ON `operateur`.`id_operateur` = `transaction`.`id_operateur`
JOIN `frais` ON `frais`.`id_frais` = `transaction`.`id_frais`
WHERE `transaction`.`id_operateur` = '1'

    public function totalFrais($idOperateur)
    {
        return $this->selectSum('frais.frais', 'total')
            ->join('frais', 'frais.id_frais = transaction.id_frais')
            ->where('transaction.id_operateur', $idOperateur)
            ->first();
---
SELECT `transaction`.*, `client`.`nom`, `client`.`numero`, `operateur`.`nom` as `operateur`, `frais`.`frais`
FROM `transaction`
JOIN `client` ON `client`.`id_client` = `transaction`.`id_client`
JOIN `operateur` ON `operateur`.`id_operateur` = `transaction`.`id_operateur`
JOIN `frais` ON `frais`.`id_frais` = `transaction`.`id_frais`
WHERE `transaction`.`id_operateur` = '3'
SELECT SUM(`frais`.`frais`) AS `total`
FROM `transaction`
JOIN `frais` ON `frais`.`id_frais` = `transaction`.`id_frais`
WHERE `transaction`.`id_operateur` = '1'
 LIMIT 1

    public function totalCommission($idOperateur)
    {
        return $this->selectSum('pourcentage_commission', 'total')
            ->where('transaction.id_operateur', $idOperateur)
            ->first();
---
SELECT SUM(`pourcentage_commission`) AS `total`
FROM `transaction`
WHERE `transaction`.`id_operateur` = '1'
 LIMIT 1

   public function totalMontant($idOperateur)
{
    return $this->selectSum('transaction.montant', 'total')
        ->where('transaction.id_operateur', $idOperateur)
        ->first();
---
SELECT SUM(`transaction`.`montant`) AS `total`
FROM `transaction`
WHERE `transaction`.`id_operateur` = '3'
 LIMIT 1