CI4propre/Projet_tech/app/Controllers/OperateurController.php



    // Insertion transaction
    $transactionModel->insert([
        'id_client' => $idClient,
        'id_operateur' => $idOperateur,
        'id_frais' => $idFrais,
        'montant' => $montant,
        'type_transaction' => $type
    ]);
---
INSERT INTO `transaction` (`id_client`, `id_operateur`, `id_frais`, `montant`, `type_transaction`) VALUES (8, '1', 6, '70000', 'depot')