CI4propre/Projet_tech/app/Controllers/OperateurController.php

    public function ajouter()
{
    $clientModel = new ClientModel();
    $transactionModel = new TransactionModel();
    $fraisModel = new FraisModel();
    $operateurModel = new OperateurModel();

    $numero = $this->request->getPost('prefixe')
            . $this->request->getPost('numero');

    $montant = $this->request->getPost('montant');
    $type = $this->request->getPost('type_transaction');

    // récupération opérateur
    $idOperateur = $this->request->getPost('id_operateur');
$operateur = $operateurModel->find($idOperateur);

if (!$operateur) {
    return redirect()->back()
        ->with('error', 'Opérateur introuvable');
}

    // Recherche ou création du client
    $client = $clientModel
        ->where('numero', $numero)
        ->first();


    if (!$client) {

        $clientModel->insert([
            'nom' => 'Client',
            'numero' => $numero
        ]);
---
SELECT *
FROM `operateur`
WHERE `operateur`.`id_operateur` = '3'
SELECT *
FROM `client`
WHERE `numero` = '0373229513'
 LIMIT 1
INSERT INTO `client` (`nom`, `numero`) VALUES ('Client', '037555555')

$pourcentage_commission = ($fraistransaction * $commission) / 100;

    // Insertion transaction
   $transactionModel->insert([
    'id_client' => $idClient,
    'id_operateur' => $idOperateur,
    'id_frais' => $idFrais,
    'montant' => $montant,
    'type_transaction' => $type,
    'pourcentage_commission' => $pourcentage_commission
]);
---
INSERT INTO `transaction` (`id_client`, `id_operateur`, `id_frais`, `montant`, `type_transaction`, `pourcentage_commission`) VALUES (3, '3', 5, '50000', 'retrait', 40)