CI4propre/Projet_tech/app/Controllers/SituationMontantController.php

    public function index()
    {
        $operateurModel = new OperateurModel();
        $transactionModel = new TransactionModel();

        $data['operateur'] = $operateurModel->findAll();
---
SELECT *
FROM `operateur`