CI4propre/Projet_tech/app/Controllers/SituationController.php

SELECT *
FROM `operateur`
---
    public function index()
    {
        $operateurModel = new OperateurModel();
        $transactionModel = new TransactionModel();

        $data['operateur'] = $operateurModel->findAll();